BAS for accounting/src/Catalogs/СМП_УчетныеЗаписиБанков/СМП_УчетныеЗаписиБанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СМП_УчетныеЗаписиБанков</name>
  <attributes>
    <name>Банк</name>
    <type>
      <types>EnumRef.СМП_ПоддерживаемыеИнтеграцииСБанками</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедениеВзаиморасчетов</name>
    <type>
      <types>EnumRef.ВедениеВзаиморасчетовПоДоговорам</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляНовыхКонтрагентов</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступаДляНовыхКонтрагентов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентноеЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемаяОбработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьПриЗагрузкеПоступлениеНаРасчетныйСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьПриЗагрузкеСписаниеСРасчетногоСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайлаИмпорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайлаЭкспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьНенайденныеЭлементы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСПоступлениеНаРасчетныйСчет</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДССписаниеСРасчетногоСчета</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Username</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>client_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеРегламентногоЗадания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS for accounting/src/Enums/СМП_ПоддерживаемыеИнтеграцииСБанками/СМП_ПоддерживаемыеИнтеграцииСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СМП_ПоддерживаемыеИнтеграцииСБанками</name>
  <enumValues>
    <name>ПриватБанк</name>
  </enumValues>
  <enumValues>
    <name>МОНОБанк</name>
  </enumValues>
  <enumValues>
    <name>ПодключаемаяОбработка</name>
  </enumValues>
</mdclass:Enum>

BAS for accounting/src/Catalogs/СМП_УчетныеЗаписиБанков/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Загрузка данных с банка.
//
// Параметры:
//   пСтруктураПараметров - структура - настройки для получения данных.
//   пУчетнаяЗаписьБанка - СправочникСсылка.СМП_УчетныеЗаписиБанков - Учетная запись дял получения данных.
//
Процедура Загрузить(пСтруктураПараметров, пУчетнаяЗаписьБанка, ЭтоРеглЗадание = Ложь) Экспорт
	
	сПараметрыДоступа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(пУчетнаяЗаписьБанка, "Банк, ИД, Токен, Логин, Пароль");
	пСтруктураПараметров.Вставить("ПараметрыДоступа", сПараметрыДоступа);
	
	Если сПараметрыДоступа.Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.ПриватБанк Тогда
		
		МодульБанка = ОбщегоНазначения.ОбщийМодуль("СМП_РаботаСБанкамиПриватБанкAPIСервер");
		МодульБанка.Прочитать(пСтруктураПараметров, пУчетнаяЗаписьБанка, ЭтоРеглЗадание);
		
	ИначеЕсли сПараметрыДоступа.Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.ПУМБ Тогда
		
		МодульБанка = ОбщегоНазначения.ОбщийМодуль("СМП_РаботаСБанкамиПУМБAPIСервер");
		МодульБанка.Прочитать(пСтруктураПараметров, пУчетнаяЗаписьБанка, ЭтоРеглЗадание);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
